# Taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "1password/tap"
tap "heroku/brew"

# Brews
# brew "bashcards"
# brew "asdf"
brew "bat"
brew "clamav"
brew "coreutils"
brew "ctop"
brew "diff-so-fancy"
brew "diskonaut"
brew "dive"
brew "elixir"
brew "exercism"
brew "eza"
brew "ffmpeg"
brew "findutils"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git-delta"
#brew "git-filter-repo"
brew "gnu-sed"
brew "gnupg"
brew "golang"
brew "helix"
brew "heroku"
brew "htop"
brew "icu4c" # for ghcup
brew "jq"
brew "llvm@13" # for ghcup
brew "mas"
brew "neovim"
brew "nodejs"
brew "pinentry-mac"
brew "postgresql@15"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
#brew "speedtest-cli"
brew "spotify_player"
brew "shellcheck"
brew "tldr"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tokei"
brew "tree"
brew "webp"
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "1password/tap/1password-cli"
cask "alacritty"
cask "brave-browser"
# cask "calibre"
cask "colour-contrast-analyser"
cask "coscreen"
cask "deckset"
#cask "discord"
#cask "docker"
cask "dropbox"
# cask "flux"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-lilex-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "google-chrome"
# cask "iterm2"
# cask "libreoffice"
cask "netnewswire"
cask "oversight"
# cask "pgadmin4"
# cask "postico"
cask "postman"
cask "proxyman"
# cask "psequel"
cask "slack"
cask "spotify"
cask "steam"
# cask "tableplus"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
cask "vlc"
cask "visual-studio-code"
cask "zoom"

# Mac App Store apps
mas "Hush", id: 1544743900
mas "Just Focus", id: 1142151959
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
# mas Medis = 1063631769;
mas "Xcode", id: 497799835

# Extra config
cask "firefox-developer-edition", args: { language: "es" }
cask_args appdir: "~/Applications", require_sha: true
