tap "caskroom/cask"
tap "caskroom/versions"
tap "heroku/brew"
cask "deckset"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "muzzle"
cask "oversight"
cask "postico"
cask "pgadmin4"
cask "psequel"
cask "sketch"
cask "slack"
cask "spotify"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
