tap "homebrew/cask"
tap "heroku/brew"
cask_args appdir: "/Applications"
brew "clamav"
brew "postgres"
cask "deckset"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "muzzle"
cask "oversight"
cask "pgadmin4"
cask "psequel"
cask "screen"
cask "sketch"
cask "slack"
cask "spotify"
cask "tableplus"
cask "vlc"
cask "vscodium"
cask "zoomus"
