tap "caskroom/cask"
tap "caskroom/versions"
brew "ack"
brew "bash"
brew "dockutil"
brew "elixir"
brew "erlang"
brew "findutils"
brew "git"
brew "heroku-toolbelt"
brew "hub"
brew "neovim"
brew "postgres"
brew "python"
brew "rbenv"
brew "redis"
brew "ruby-build"
brew "speedtest-cli"
brew "valgrind"
brew "vim"
brew "watchman"
cask "codekit"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "ifunbox"
cask "iterm2"
cask "keka"
cask "licecap"
cask "psequel"
cask "sketch"
cask "slack"
cask "spotify"
cask "vlc"
