tap "caskroom/cask"
tap "caskroom/versions"
brew "ack"
brew "asciinema"
brew "awscli"
brew "bash"
brew "bat"
brew "bench"
brew "diff-so-fancy"
brew "dockutil"
brew "elixir"
brew "elm"
brew "erlang"
brew "exercism"
brew "findutils"
brew "git"
brew "gpg"
brew "heroku-toolbelt"
brew "hub"
brew "ncdu"
brew "neovim"
brew "postgres"
brew "python"
brew "rbenv"
brew "redis"
brew "rename"
brew "ruby-build"
brew "speedtest-cli"
brew "stack"
brew "tldr"
brew "tmux"
brew "valgrind"
brew "vim"
brew "watchman"
brew "wrk"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "ifunbox"
cask "iterm2"
cask "keka"
cask "licecap"
cask "muzzle"
cask "psequel"
cask "sketch"
cask "slack"
cask "spotify"
cask "vlc"
