tap "caskroom/cask"
tap "caskroom/versions"
brew "dockutil"
brew "heroku-toolbelt"
brew "postgres"
brew "python"
brew "rbenv"
brew "redis"
brew "ruby-build"
brew "valgrind"
brew "watchman"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "ifunbox"
cask "iterm2"
cask "keka"
cask "licecap"
cask "muzzle"
cask "psequel"
cask "sketch"
cask "slack"
cask "spotify"
cask "vlc"
